; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v1 - type_1 ?v3 - type_2)
 	      (pred_2 ?v4 - object ?v3 - type_2)
	      (pred_4 ?v1 - type_1 ?v6 - type_3)
	      (pred_1 ?v1 - type_1 ?v4 - object ?v6 - type_3))

   (:action op_3
       :parameters  (?v1 - type_1 ?v2 ?v8 - type_2)
       :precondition (and  (pred_3 ?v1 ?v2))
       :effect (and  (pred_3 ?v1 ?v8)
		     (not (pred_3 ?v1 ?v2))))

   (:action op_1
       :parameters (?v1 - type_1 ?v7 - object ?v5 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v7 ?v5) (pred_3 ?v1 ?v5) (pred_4 ?v1 ?v6))
       :effect (and (pred_1 ?v1 ?v7 ?v6)
		    (not (pred_2 ?v7 ?v5)) 
		    (not (pred_4 ?v1 ?v6))))

   (:action op_2
       :parameters (?v1 - type_1 ?v7 - object ?v5 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_1 ?v1 ?v7 ?v6) (pred_3 ?v1 ?v5))
       :effect (and (pred_2 ?v7 ?v5)
		    (pred_4 ?v1 ?v6)
		    (not (pred_1 ?v1 ?v7 ?v6)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_03 - type_1
obj_02 obj_14 obj_12 obj_08 - type_3
obj_10 obj_01 obj_13 obj_06 - type_2
obj_09 obj_05 obj_11 obj_04 - object)
(:init
(pred_3 obj_07 obj_13)
(pred_4 obj_07 obj_02)
(pred_4 obj_07 obj_14)
(pred_3 obj_03 obj_06)
(pred_4 obj_03 obj_12)
(pred_4 obj_03 obj_08)
(pred_2 obj_09 obj_06)
(pred_2 obj_05 obj_13)
(pred_2 obj_11 obj_01)
(pred_2 obj_04 obj_01)
)
(:goal
(and
(pred_2 obj_09 obj_01)
(pred_2 obj_05 obj_06)
(pred_2 obj_11 obj_06)
(pred_2 obj_04 obj_10)
)
)

(:constraints
  (always (not (pred_3 obj_07 obj_06)))
)
)

; plan
1. (op_3 obj_07 obj_13 obj_10)
   deleted: (pred_3 obj_07 obj_13)
   added: (pred_3 obj_07 obj_10)
   goals met: 0 of 4
2. (op_1 obj_03 obj_09 obj_06 obj_08)
   deleted: (pred_2 obj_09 obj_06) (pred_4 obj_03 obj_08)
   added: (pred_1 obj_03 obj_09 obj_08)
   goals met: 0 of 4
3. (op_3 obj_07 obj_10 obj_01)
   deleted: (pred_3 obj_07 obj_10)
   added: (pred_3 obj_07 obj_01)
   goals met: 0 of 4
4. (op_3 obj_03 obj_06 obj_01)
   deleted: (pred_3 obj_03 obj_06)
   added: (pred_3 obj_03 obj_01)
   goals met: 0 of 4
5. (op_1 obj_07 obj_04 obj_01 obj_14)
   deleted: (pred_2 obj_04 obj_01) (pred_4 obj_07 obj_14)
   added: (pred_1 obj_07 obj_04 obj_14)
   goals met: 0 of 4
6. (op_2 obj_03 obj_09 obj_01 obj_08)
   deleted: (pred_1 obj_03 obj_09 obj_08)
   added: (pred_2 obj_09 obj_01) (pred_4 obj_03 obj_08)
   goals met: 1 of 4
7. (op_1 obj_03 obj_11 obj_01 obj_12)
   deleted: (pred_2 obj_11 obj_01) (pred_4 obj_03 obj_12)
   added: (pred_1 obj_03 obj_11 obj_12)
   goals met: 1 of 4
8. (op_3 obj_07 obj_01 obj_10)
   deleted: (pred_3 obj_07 obj_01)
   added: (pred_3 obj_07 obj_10)
   goals met: 1 of 4
9. (op_3 obj_03 obj_01 obj_13)
   deleted: (pred_3 obj_03 obj_01)
   added: (pred_3 obj_03 obj_13)
   goals met: 1 of 4
10. (op_2 obj_07 obj_04 obj_10 obj_14)
   deleted: (pred_1 obj_07 obj_04 obj_14)
   added: (pred_2 obj_04 obj_10) (pred_4 obj_07 obj_14)
   goals met: 2 of 4
11. (op_1 obj_03 obj_05 obj_13 obj_08)
   deleted: (pred_2 obj_05 obj_13) (pred_4 obj_03 obj_08)
   added: (pred_1 obj_03 obj_05 obj_08)
   goals met: 2 of 4
12. (op_3 obj_03 obj_13 obj_06)
   deleted: (pred_3 obj_03 obj_13)
   added: (pred_3 obj_03 obj_06)
   goals met: 2 of 4
13. (op_2 obj_03 obj_11 obj_06 obj_12)
   deleted: (pred_1 obj_03 obj_11 obj_12)
   added: (pred_2 obj_11 obj_06) (pred_4 obj_03 obj_12)
   goals met: 3 of 4
14. (op_2 obj_03 obj_05 obj_06 obj_08)
   deleted: (pred_1 obj_03 obj_05 obj_08)
   added: (pred_2 obj_05 obj_06) (pred_4 obj_03 obj_08)
   goals met: 4 of 4
